## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application_registration.rcm_adf_app will be created
  + resource "azuread_application_registration" "rcm_adf_app" {
      + client_id                      = (known after apply)
      + disabled_by_microsoft          = (known after apply)
      + display_name                   = "vj-rcm-dev-adf-app"
      + id                             = (known after apply)
      + object_id                      = (known after apply)
      + publisher_domain               = (known after apply)
      + requested_access_token_version = 2
      + sign_in_audience               = "AzureADMyOrg"
    }

  # azuread_service_principal.rcm_adf_sp will be created
  + resource "azuread_service_principal" "rcm_adf_sp" {
      + account_enabled              = true
      + app_role_assignment_required = false
      + app_role_ids                 = (known after apply)
      + app_roles                    = (known after apply)
      + application_tenant_id        = (known after apply)
      + client_id                    = (known after apply)
      + display_name                 = (known after apply)
      + homepage_url                 = (known after apply)
      + id                           = (known after apply)
      + logout_url                   = (known after apply)
      + oauth2_permission_scope_ids  = (known after apply)
      + oauth2_permission_scopes     = (known after apply)
      + object_id                    = (known after apply)
      + owners                       = [
          + "68469a57-c1fd-46d1-ba9c-c42616f8ea86",
        ]
      + redirect_uris                = (known after apply)
      + saml_metadata_url            = (known after apply)
      + service_principal_names      = (known after apply)
      + sign_in_audience             = (known after apply)
      + tags                         = (known after apply)
      + type                         = (known after apply)

      + feature_tags (known after apply)

      + features (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>